app/views/welcome/index.html.erb

SELECT "cities".* FROM "cities"  ORDER BY country_name ASC, city_name ASC
SELECT "cities".* FROM "cities"
---
      <form class="filter_locations", action="", method="get">
       <% @options = City.all.order("country_name ASC").order("city_name ASC").map { |a| [  a.city_name+', ' + a.country_name, a.id] } %>
       <%= select_tag "city", options_for_select(@options), :onchange => "this.form.action = '/cities/' +\
       this.value;", :include_blank => true %>