app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"  ORDER BY country_name ASC, city_name ASC
---
  def index
    @cities = City.all

INSERT INTO "cities" ("city_name", "country_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["city_name", "Brighton"], ["country_name", "USA"], ["created_at", "2015-02-07 22:31:24.811331"], ["updated_at", "2015-02-07 22:31:24.811331"]]
---
  def create
    @city = City.new(city_params)
    if @city.save

UPDATE "cities" SET "city_name" = $1, "country_name" = $2, "updated_at" = $3 WHERE "cities"."id" = $4  [["city_name", "Paris"], ["country_name", "France"], ["updated_at", "2015-02-06 19:14:55.995648"], ["id", 69]]
---
  def update
    if @city.update(city_params)

DELETE FROM "cities" WHERE "cities"."id" = $1  [["id", 114]]
---
  def destroy
    @city.destroy

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 114]]
---
  def set_city
    @city = City.find(params[:id])