app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."suggestion_id" = $1  [["suggestion_id", 1]]
---
  def index
    @comments = @suggestion.comments.all

INSERT INTO "comments" ("body", "suggestion_id") VALUES ($1, $2) RETURNING "id"  [["body", "The Nyhavn boat tour is awesome because you get a great uncrowded view of the little mermaid statue without tourists everywhere!"], ["suggestion_id", 1]]
---
 def create
    @comment = @suggestion.comments.build(comment_params)
    if @comment.save

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 5]]
---
    def set_city
      @city = City.find(params[:city_id])

SELECT  "suggestions".* FROM "suggestions" WHERE "suggestions"."city_id" = $1 AND "suggestions"."id" = $2 LIMIT 1  [["city_id", 5], ["id", 1]]
---
    def set_suggestion
      @suggestion = @city.suggestions.find(params[:suggestion_id])