app/controllers/suggestions_controller.rb

  def create
    @suggestion = Suggestion.new(suggestion_params)
    @suggestion.city = City.find(params[:city_id])
    if @suggestion.save
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 5]]
INSERT INTO "suggestions" ("name", "ideas", "city_id") VALUES ($1, $2, $3) RETURNING "id"  [["name", "jsbgksjh"], ["ideas", "kjdbgjkdfbbdfmvcmnvbzv"], ["city_id", 5]]

  def show
    @suggestion = @city.suggestions.find(params[:id])
---
SELECT  "suggestions".* FROM "suggestions" WHERE "suggestions"."city_id" = $1 AND "suggestions"."id" = $2 LIMIT 1  [["city_id", 1], ["id", 1]]

  def set_city
    @city = City.find(params[:city_id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 5]]