app/controllers/welcome_controller.rb

  def index
    @cities = City.all.order("country_name ASC").order("city_name ASC")
---
SELECT "cities".* FROM "cities"  ORDER BY country_name ASC, city_name ASC