app/views/cities/index.html.erb

    <form class="filter_locations", action="", method="get">
       <% @options = City.all.map { |a| [  a.city_name, a.country_name, a.id] } %>
---
SELECT "cities".* FROM "cities"  ORDER BY country_name ASC, city_name ASC