app/views/cities/show.html.erb

SELECT "suggestions".* FROM "suggestions" WHERE "suggestions"."city_id" = $1  ORDER BY category ASC  [["city_id", 1]]
---
<div class="suggestions">
  <% @city.suggestions.each do |suggestion| %>