app/views/suggestions/show.html.erb


  <% @suggestion.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."suggestion_id" = $1  [["suggestion_id", 1]]