app/views/suggestions/show.html.erb

<div>
    <% @city.suggestions.each do |suggestion| %>
---
SELECT  "suggestions".* FROM "suggestions" WHERE "suggestions"."city_id" = $1 AND "suggestions"."id" = $2 LIMIT 1  [["city_id", 5], ["id", 1]]